# wsInstallFailed

## Description
This function must be called inside 'add_to_workspace' script and it will mark the install as failed, showing an alert dialog at the end.

```pascal
PROCEDURE wsInstallFailed(failed : BOOLEAN);
```

```python
def vs.wsInstallFailed(failed):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|failed|BOOLEAN|   |

## Examples
```pascal
wsInstallFailed(TRUE);
```
```python
import vs

# This function must be called inside 'add_to_workspace' script and it will
# mark the install as failed, showing an alert dialog at the end.
failed = True

vs.wsInstallFailed(failed)
```

## Version
Availability: from Vectorworks 2021

## Category
* Workspaces